{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "arguments": {}, "name": "lambda_1", "output_shape_type": "raw", "trainable": true, "batch_input_shape": [null, 64, 64, 3], "output_shape": [64, 64, 3], "function": "\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>(\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "name": "convolution2d_1", "border_mode": "same", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "nb_row": 5, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "bias": true, "nb_filter": 24, "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [1, 1]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "name": "convolution2d_2", "border_mode": "same", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "nb_row": 5, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "bias": true, "nb_filter": 36, "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [1, 1]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "name": "convolution2d_3", "border_mode": "same", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "nb_row": 5, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "bias": true, "nb_filter": 48, "dim_ordering": "tf", "subsample": [2, 2], "nb_col": 5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [1, 1]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "name": "convolution2d_4", "border_mode": "same", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "nb_row": 3, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "bias": true, "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "nb_col": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [1, 1]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "name": "convolution2d_5", "border_mode": "same", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "nb_row": 3, "activation": "linear", "activity_regularizer": null, "b_regularizer": null, "bias": true, "nb_filter": 64, "dim_ordering": "tf", "subsample": [1, 1], "nb_col": 3}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_5", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [1, 1]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_1", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "linear", "W_constraint": null, "b_regularizer": null, "bias": true, "input_dim": null, "output_dim": 1164}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_2", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "linear", "W_constraint": null, "b_regularizer": null, "bias": true, "input_dim": null, "output_dim": 100}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_3", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "linear", "W_constraint": null, "b_regularizer": null, "bias": true, "input_dim": null, "output_dim": 50}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_4", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "linear", "W_constraint": null, "b_regularizer": null, "bias": true, "input_dim": null, "output_dim": 10}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_5"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "name": "dense_5", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activation": "linear", "W_constraint": null, "b_regularizer": null, "bias": true, "input_dim": null, "output_dim": 1}}], "keras_version": "1.0.7"}